[{"id":1,"title":"Ultron Mask","description":"The Ultron Mask from the latest Avengers film - Avengers: Age of Ultron was designed in started in Zbrush, by modelling a basic form by using a head template, the model was then imported to 3D Studio Max for the hard surface details, lastly importing the files into Rhino to sliceinto parts.","image":"https:\/\/myminifactory.net\/\/uploads\/object-thumbnails\/94613c82d8eb893ca6dfb28164ba33946583759c.jpg"},{"id":2,"title":"Wolf Head Talisman","description":"The Witcher game is based on the book series of the same name by Polish author Andrzej Sapkowski. The Witcher takes place in a medieval fantasy world and follows the story of Geralt, one of a few remaining \u0022witchers\u0022 – traveling monster hunters for hire, gifted with unnatural powers.","image":"https:\/\/myminifactory.net\/uploads\/object-thumbnails\/bcde1f821af6b22284e96906137ff360d8419495.JPG"},{"id":3,"title":"The Barbarian King","description":"The Barbarian King is the toughest and the meanest barbarian in all the realm, whose appetite for Dark Elixir has caused him to grow to a giant size.","image":"https:\/\/myminifactory.net\/uploads\/object-thumbnails\/135c60b52aa930a62890c8610ea669f9fca030c1.jpg"},{"id":4,"title":"The Game of Thrones Hound\u0027s Head Helm","description":" The Game of Thrones Hound\u0027s Head Helm. This print consists of 4 pieces: the Head, the Jaw, the back and the front of the helmet. You can rotate the head to get the awesome look you like!!","image":"https:\/\/myminifactory.net\/uploads\/object-thumbnails\/788f7bb38d32a969d41c0017b1edc5addb05e8f0.jpg"},{"id":5,"title":"Zelda Master Sword","description":"The Master Sword, also known as The Blade of Evil\u0027s Bane is a recurring legendary sword in the Zelda series. Originally crafted by the goddess Hylia as the Goddess Sword, it was later forged into the Master Sword by the goddess\u0027 chosen hero and its spirit FI, who bathed it in the three Sacred Flames located across the ladn that would become the Kingdom of Hyrule. Din\u0027s Flame in particular, imbued the sword with the power to repel evil, a power apparently augmented after the sword recieved the blessing of Zelda, which transformed the blade into the True Master Sword.","image":"https:\/\/myminifactory.net\/uploads\/object-thumbnails\/78fecc565634076deb4d2f88752bba1e1d644db6.jpg"},{"id":6,"title":"Ghost Destiny","description":"A Ghost is a levitating artificial intelligence used by Guardians, this one fits perfectly in the palm of your hand.","image":"https:\/\/myminifactory.net\/uploads\/object-thumbnails\/2d1fdae75d9063a0ac69d133dd24f89daa37a913.jpg"},{"id":7,"title":"Han Solo Blaster","description":"The DL-44 was a powerful, highly modifiable and accurate blaster pistol. It packed a heavy punch compared to other pistols without losing accuracy, which made it a prime choice among many groups and individuals, ranging from smugglersand bounty hunters to military and the Rebellion. This is a Toy.","image":"https:\/\/myminifactory.net\/uploads\/object-thumbnails\/437c65c4c970f9f669eda8e097d35f1098db3f4b.jpg"},{"id":8,"title":"Sons of the Harpy Mask","description":"The Sons of the Harpy are an underground insurgency fighting the rule of Daenerys Targaryen over Meereen. They take their name from the Harpy, the traditional heraldic symbol of the slave-masters in the Ghiscari cities of Slaver\u0027s Bay, and the Ghiscari Empire before them. They conceal their identities wearing masks that look like harpies.","image":"https:\/\/myminifactory.net\/uploads\/object-thumbnails\/8d7afd2961cf7b90e60f20920e21fb522624f1db.jpg"}]